"Job Log" = "Journal des travaux";
"Job Log2" = "Journal des travaux";

"User ID" = "ID utilisateur";
"User ID:" = "ID utilisateur:";

"Job Type" = "Type d'impression";
"Job Type:" = "Type d'impression:";

"File Name" = "Nom de fichier";
"File Name:" = "Nom de fichier:";

"Password" = "Mot de passe";
"Password:" = "Mot de passe:";

"User Code" = "Code utilisateur";
"User Code:" = "Code utilisateur:";

"Time" = "Heure";
"Time:" = "Heure:";

"Enable User Code" = "Activer code utilisateur";
"Pop up Every Time" = "Apparaître à chaque fois";
"User Code Always Blank" = "Code utilisateur toujours vierge";
"OK" = "OK";
"Cancel" = "Annuler";
"Enable Specify Time" = "Déf. heure impr.";

"Folder Number" = "Numéro de dossier";
"Folder Number:" = "Numéro de dossier:";

"Folder Password" = "Mot de passe dossier";
"Folder Password:" = "Mot de passe dossier:";

"Normal Print" = "Impression normale";
"Sample Print" = "Impression d'épreuve";
"Locked Print" = "Impression sécurisée";
"Hold Print" = "Impression suspendue";
"Stored Print" = "Impression stockée";
"Store and Print" = "Stocker et imprimer";
"Document Server" = "Serveur de documents";

"(4-8 digits)" = "(4 à 8 chiffres.)";

"Enter a valid File Name" = "Saisir un nom de fichier valide.";
"Enter a valid Password" = "Saisir un mot de passe valide.";
"Enter a valid User Code" = "Saisir un code utilisateur valide.";
"Enter a valid User ID" = "Saisir un ID utilisateur valide.";
"Enter a valid Folder Password" = "Saisir un mot de passe dossier valide.";

"(Up to 8 alphanumeric characters)" = "(Jusqu'à 8 caractères alphanumériques.)";
"(Up to 16 alphanumeric characters)" = "(Jusqu'à 16 caractères alphanumériques.)";
"(4 digits)" = "(4 à 8 chiffres.)";
"(Up to 8 digits)" = "(4 à 8 chiffres.)";